app/controllers/stories_controller.rb

  def index
    @stories = Story.page(params[:page]).per(25)
---
SELECT  "stories".* FROM "stories" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "stories"

  def create
    @story = Story.new(params.require(:story).permit(:title, :writer, :preview, :url))
    if @story.save
---
INSERT INTO "stories" ("title", "writer", "preview", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)